In [1]:
import pandas as pd

In [3]:
df1 = pd.DataFrame(
    {
        'a': [1, 2, 3, 4],
        'b': [2.3, 5.6, None, 8.9],
    }
)

df1

   a    b
0  1  2.3
1  2  5.6
2  3  NaN
3  4  8.9

In [4]:
print("Data types for df1:")
print(df1.dtypes)

Data types for df1:
a      int64
b    float64
dtype: object

In [5]:
df2 = pd.DataFrame(
    {
        'a': ["1", 2, 3, 4],
        'b': [2.3, 5.6, None, 8.9],
    }
)
df2

   a    b
0  1  2.3
1  2  5.6
2  3  NaN
3  4  8.9

In [6]:
print("Data types for df2:")
print(df2.dtypes)

Data types for df2:
a     object
b    float64
dtype: object

In [8]:
df_concat =  pd.concat([df1, df2]).reset_index(drop=True)
df_concat

   a    b
0  1  2.3
1  2  5.6
2  3  NaN
3  4  8.9
4  1  2.3
5  2  5.6
6  3  NaN
7  4  8.9

In [10]:
df_concat.drop_duplicates()

   a    b
0  1  2.3
1  2  5.6
2  3  NaN
3  4  8.9
4  1  2.3

In [11]:
df_concat.dtypes

a     object
b    float64
dtype: object